[
  {
    "pid": "1",
    "marca": "Apple",
    "model": "MacBook Air M1",
    "preu": "1578.15",
    "tipus": "Portàtils",
    "processador": "M1",
    "ram": "8GB",
    "gràfica": "Integrada",
    "polzades": "13.3",
    "emmagatzematge": "512GB SSD",
    "imatge": "macbook-air.webp",
    "href": "",
    "descripcio": "El poder no ocupa lugar. El chip M1 de Apple redefine nuestro portátil más fino y ligero. La CPU es hasta 3,5 veces más potente. Los gráficos, hasta cinco veces más rápidos. Un Neural Engine más avanzado llega a multiplicar por nueve la velocidad del aprendizaje automático. Además tiene la mayor autonomía en un MacBook Air y un diseño sin ventilador que lo vuelve ultrasilencioso. Descubre un talento sin precedentes listo para seguirte a cualquier parte.",
    "stock": "0.00"
  },
  {
    "pid": "2",
    "marca": "Apple",
    "model": "MacBook Pro M1",
    "preu": "2689.01",
    "tipus": "Portàtils",
    "processador": "M1",
    "ram": "16GB",
    "gràfica": "Integrada",
    "polzades": "16.2",
    "emmagatzematge": "512GB SSD",
    "imatge": "macbook-pro.jpg",
    "href": "",
    "descripcio": "Ya está aquí el MacBook Pro más potente de la historia. Su rendimiento y eficiencia son enormes gracias a los chips M1 Pro y M1 Max, los primeros que Apple diseña para profesionales. Incluye una asombrosa pantalla Liquid Retina XDR, la mejor cámara y el mejor sistema de sonido en un portátil Mac, además de todos los puertos que vas a necesitar. Estás ante el primer portátil de una nueva especie. Y es una bestia.",
    "stock": "0.00"
  },
  {
    "pid": "3",
    "marca": "Microsoft",
    "model": "Surface Laptop Go",
    "preu": "789.00",
    "tipus": "Portàtils",
    "processador": "Intel Core i5-1035G1",
    "ram": "8GB",
    "gràfica": "Integrada",
    "polzades": "12.4",
    "emmagatzematge": "256GB SSD",
    "imatge": "surface.jpg",
    "href": "",
    "descripcio": "Aprovecha al máximo cada día con el elegante estilo, rendimiento y una batería que dura todo el día que necesitas en nuestro dispositivo Surface Laptop más ligero, todo a un valor excepcional.",
    "stock": "0.00"
  },
  {
    "pid": "4",
    "marca": "Lenovo",
    "model": "IdeaPad 3 15ITL6",
    "preu": "599.00",
    "tipus": "Portàtils",
    "processador": "Intel Core i5-1135G7",
    "ram": "8GB",
    "gràfica": "Integrada",
    "polzades": "15.6",
    "emmagatzematge": "512GB SSD",
    "imatge": "lenovo-ideapad.webp",
    "href": "",
    "descripcio": "Justo el rendimiento que necesitas. ¿Buscas un portátil de gama básica lo suficientemente potente para que te ayude a sacar el trabajo adelante? Echa un vistazo al IdeaPad 3 (15, Intel) de 39,62 cm (15,6'). Los últimos procesadores Intel® Core™ de 11.ª generación aumentan el rendimiento, te permiten realizar fácilmente varias tareas a la vez y te ofrecen una extraordinaria experiencia de entretenimiento. Los detalles de diseño bien meditados, como el obturador de seguridad físico de la cámara web, completan el producto.",
    "stock": "0.00"
  },
  {
    "pid": "5",
    "marca": "HP",
    "model": "Pavilion TG01-2085ns",
    "preu": "999.99",
    "tipus": "Sobretaula",
    "processador": "AMD Ryzen 7 5700G",
    "ram": "16GB",
    "gràfica": "RTX 3060",
    "polzades": "0",
    "emmagatzematge": "1TB + 512GB SSD",
    "imatge": "hp-pavilion.webp",
    "href": "",
    "descripcio": "Más potencia desde el primer momento. Juega como siempre has querido. Este potente equipo está diseñado para seguir el ritmo de los juegos más actuales y de los que están por venir. Bajo su exterior compacto y elegante, encontrarás toda la potencia que necesitas para jugar a lo que quieras y el espacio necesario para incorporar mejoras.",
    "stock": "0.00"
  },
  {
    "pid": "6",
    "marca": "Asus",
    "model": "S500MC-5114000410",
    "preu": "549.99",
    "tipus": "Sobretaula",
    "processador": "Intel Core i5-11400",
    "ram": "16GB",
    "gràfica": "Integrada",
    "polzades": "0",
    "emmagatzematge": "512GB SSD",
    "imatge": "asus.webp",
    "href": "",
    "descripcio": "El ASUS S500MC es un elegante y versátil PC de sobremesa doméstico que ofrece unas prestaciones ideales para crear contenidos, trabajar, aprender a distancia y disfrutar de juegos. Está disponible con procesadores Intel® Core™ de 11.ª Gen., gráficas NVIDIA® de alto rendimiento, cancelación de ruido bidireccional con IA y un sistema térmico que mantiene las temperaturas de todos los componentes bajo control. Además, su excepcional calidad de construcción garantiza una excelente fiabilidad a largo plazo y su contemporáneo acabado geométrico combina a la perfección en cualquier hogar moderno.",
    "stock": "0.00"
  },
  {
    "pid": "7",
    "marca": "HP",
    "model": "OMEN 45L GT22-0019ns",
    "preu": "2499.99",
    "tipus": "Sobretaula",
    "processador": "Intel Core i9-12900K",
    "ram": "32GB",
    "gràfica": "RTX 3080",
    "polzades": "0",
    "emmagatzematge": "2TB + 1TB SSD",
    "imatge": "hp-omen.webp",
    "href": "",
    "descripcio": "Concebido para un rendimiento extremo, el ordenador gaming OMEN by HP 45L se ha diseñado específicamente para el gaming. Equipado con el último procesador Intel® , el ordenador gaming OMEN by HP lleva la refrigeración a cotas increíbles con una exclusiva cámara de refrigeración. Creado para actualizarse de manera sencilla y sin necesidad de herramientas, con componentes estándar del sector a la medida de tus necesidades de gaming.",
    "stock": "0.00"
  },
  {
    "pid": "8",
    "marca": "MSI",
    "model": "MPG Trident A",
    "preu": "1699.01",
    "tipus": "Sobretaula",
    "processador": "Intel Core i7-12700F",
    "ram": "16GB",
    "gràfica": "RTX 3060",
    "polzades": "0",
    "emmagatzematge": "1TB SSD",
    "imatge": "msi-trident.webp",
    "href": "",
    "descripcio": "La serie MEG busca trascender los productos gaming actuales, como el modelo insignia diseñado para empujar los límites de una serie para gaming extremo. Combinando los puntos fuertes de nuestro arsenal existente con la nueva tecnología innovadora; obtenemos mejoras significativas en la eficiencia operativa y de juego. Con la serie gaming MEG, toma el control completo del rendimiento y la personalización definitiva.",
    "stock": "0.00"
  },
  {
    "pid": "9",
    "marca": "Newskill",
    "model": "Serike TKL",
    "preu": "54.78",
    "tipus": "Teclats",
    "processador": "",
    "ram": "",
    "gràfica": "",
    "polzades": "0",
    "emmagatzematge": "",
    "imatge": "newskill.webp",
    "href": "",
    "descripcio": "Newskill Serike TKL Ivory es parte de una gama de teclados muy compactos y ligeros que a la vez nos proporcionan seguridad en cada click. La gran novedad que supone Serike TKL Ivory se debe a que es un teclado compacto TenKeyLess que deja de lado todo el pad numérico para ofrecerte toda su potencia y características en un formato ideal para que te acompañe cómodamente a cualquier zona de juego o para liberar espacio en tu set-up. Un diseño RGB característico que nos dará un aura de retroiluminación a su alrededor y a lo largo de todas sus teclas aunado con las ventajas de los teclados TKL. Completa tu set-up en color blanco con Serike TKL Ivory.",
    "stock": "0.00"
  },
  {
    "pid": "10",
    "marca": "Forgeon",
    "model": "Clutch",
    "preu": "99.99",
    "tipus": "Teclats",
    "processador": "",
    "ram": "",
    "gràfica": "",
    "polzades": "0",
    "emmagatzematge": "",
    "imatge": "forgeon.webp",
    "href": "",
    "descripcio": "Forgeon llega con fuerza con este nuevo modelo de teclado. El Forgeon Clutch Keyboard Blue. Un teclado ergonómico y sofisticado que te brindará una experiencia gaming formidable. Su diseño está totalmente preparado para que puedas disfrutar del espacio que necesitas en tu escritorio y te olvides de esos golpes indeseados entre ratón y teclado mientras juegas ¡Adquiere ya este teclado y no te quedes sin jugar!",
    "stock": "0.00"
  },
  {
    "pid": "11",
    "marca": "Owlotech",
    "model": "K500W",
    "preu": "10.49",
    "tipus": "Teclats",
    "processador": "",
    "ram": "",
    "gràfica": "",
    "polzades": "0",
    "emmagatzematge": "",
    "imatge": "owlotech.webp",
    "href": "",
    "descripcio": "¿Estás buscando el complemento perfecto para tu tablet? Deja de buscar y fíjate en el exclusivo teclado de Owlotech K500W. Un teclado con tecnología bluetooth que te proporciona un aumento de tu productividad y hace que trabajes más cómodamente en tus momentos de teletrabajo, oficina u ocio. Adquiere ahora este teclado y comienza a disfrutar.",
    "stock": "0.00"
  },
  {
    "pid": "12",
    "marca": "Logitech",
    "model": "K120",
    "preu": "10.99",
    "tipus": "Teclats",
    "processador": "",
    "ram": "",
    "gràfica": "",
    "polzades": "0",
    "emmagatzematge": "",
    "imatge": "logitech.webp",
    "href": "",
    "descripcio": "Teclado Logitech® K120. Una mejor experiencia de escritura durante mucho tiempo. Podrás escribir cómodamente con teclas planas que apenas hacen ruido, en un teclado con distribución estándar, teclas F de tamaño normal y teclado numérico.",
    "stock": "0.00"
  },
  {
    "pid": "13",
    "marca": "Razer",
    "model": "Viper Ultimate",
    "preu": "120.00",
    "tipus": "Ratolins",
    "processador": "",
    "ram": "",
    "gràfica": "",
    "polzades": "0",
    "emmagatzematge": "",
    "imatge": "viper-ultimate.webp",
    "href": "",
    "descripcio": "Te presentamos el ratón para juegos con tecnología inalámbrica ultrarrápida diseñada para ofrecerte un rendimiento profesional.",
    "stock": "0.00"
  },
  {
    "pid": "14",
    "marca": "HP",
    "model": "Z3700",
    "preu": "14.99",
    "tipus": "Ratolins",
    "processador": "",
    "ram": "",
    "gràfica": "",
    "polzades": "0",
    "emmagatzematge": "",
    "imatge": "ratoli-hp.webp",
    "href": "",
    "descripcio": "Es el momento que tus accesorios se ajusten a tu individualidad. Conoce tu nuevo ratón inalámbrico, el ratón HP Z3700, cuidadosamente concebido para llevar a tu trabajo tu estilo único y elegante. Es funcional, es portátil, está de moda. Es tuyo",
    "stock": "0.00"
  },
  {
    "pid": "15",
    "marca": "Asus",
    "model": "Spatha X",
    "preu": "129.98",
    "tipus": "Ratolins",
    "processador": "",
    "ram": "",
    "gràfica": "",
    "polzades": "0",
    "emmagatzematge": "",
    "imatge": "ratoli-asus.jpg",
    "href": "",
    "descripcio": "Entra en combate con el ROG Spatha X. Este ratón gaming inalámbrico se puede conectar a través de RF 2,4 GHz o con un cable USB-C®. Especialmente ajustado, el sensor de 19.000 ppi te permite derribar a tus oponentes con una precisión extrema, mientras que los 12 botones programables garantizan que tengas todos los comandos al alcance de la mano. El ROG Spatha X cuenta con un exclusivo diseño intercambiable de interruptores, microinterruptores ROG, Aura Sync RGB y una base de carga magnética.",
    "stock": "0.00"
  },
  {
    "pid": "16",
    "marca": "Tempest",
    "model": "x20W Vigilant",
    "preu": "27.00",
    "tipus": "Ratolins",
    "processador": "",
    "ram": "",
    "gràfica": "",
    "polzades": "0",
    "emmagatzematge": "",
    "imatge": "ratoli-tempest.webp",
    "href": "",
    "descripcio": "Un ratón inalámbrico todoterreno pensado para cualquier tipo de ámbito. Ya seas gamer o un gran profesional dedicado a tu trabajo, este ratón se adaptará perfectamente a las exigencias de ambos entornos.",
    "stock": "0.00"
  },
  {
    "pid": "17",
    "marca": "Beyerdynamic",
    "model": "DT-770 Pro",
    "preu": "120.99",
    "tipus": "Auriculars",
    "processador": "",
    "ram": "",
    "gràfica": "",
    "polzades": "0",
    "emmagatzematge": "",
    "imatge": "dt770.webp",
    "href": "",
    "descripcio": "El Beyerdynamic DT770 Pro 80 Ohm es un auricular, sencillamente profesional. Sin duda la prestigiosa marca Beyerdynamic ha sabido crear unos auriculares fiables 100% a la escucha como si de unos monitores profesionales se tratara. Gracias a su tecnología dinámica cerrada, los DT 770 Pro aislan en su totalidad el sonido que pueda colarse en los micrófonos dentro del estudio. Con un suave acolchado y una diadema ajustable, estos auriculares están especialmente diseñados para poder usarlos durante un largo periodo de tiempo.",
    "stock": "0.00"
  },
  {
    "pid": "18",
    "marca": "Xiaomi",
    "model": "Mi True Wireless Earphones 2",
    "preu": "23.99",
    "tipus": "Auriculars",
    "processador": "",
    "ram": "",
    "gràfica": "",
    "polzades": "0",
    "emmagatzematge": "",
    "imatge": "xiaomi.webp",
    "href": "",
    "descripcio": "Los auriculares inalámbricos Xiaomi Mi True Wireless Earphones 2 Basic ofrecen un excelente sonido y una gran calidad de llamada inalámbrica junto a una batería de larga duración.",
    "stock": "0.00"
  },
  {
    "pid": "19",
    "marca": "HP",
    "model": "x1000",
    "preu": "89.00",
    "tipus": "Altaveus",
    "processador": "",
    "ram": "",
    "gràfica": "",
    "polzades": "0",
    "emmagatzematge": "",
    "imatge": "hp-x1000.webp",
    "href": "",
    "descripcio": "Aprovecha al máximo tu battlestation con este elegante altavoz diseñado para ofrecer un sonido de calidad.",
    "stock": "0.00"
  },
  {
    "pid": "20",
    "marca": "Google",
    "model": "Nest Mini",
    "preu": "39.99",
    "tipus": "Altaveus",
    "processador": "",
    "ram": "",
    "gràfica": "",
    "polzades": "0",
    "emmagatzematge": "",
    "imatge": "google-nest-mini.webp",
    "href": "",
    "descripcio": "Te presentamos la 2.ª generación de Nest Mini, el altavoz que puedes controlar con tu voz. Solo tienes que decir 'Ok Google' para reproducir tu música preferida de Spotify, YouTube Music y otras plataformas.",
    "stock": "0.00"
  }
]
